app/Controllers/Bimbingfairrekap.php

    public function docs($id = false)
    {
        $session = session();
        $logged_in = $session->get('logged_in');
        $ispenilai = $session->get('ispenilai');
        if ((!$logged_in) && (!$ispenilai)) {
            return redirect()->to('/home');
        } else {
            $session->set('role', 'penilai');
        }

        if (!empty($id)) {
            $user_id = $id;
        } else {
            $user_id = $session->get('user_id');
        }

        $user_id1 = $session->get('user_id');

        $model2 = new ConfigModel();
        $config = $model2->where('config_name', 'koor_tugasakhir')->where('config_value', $user_id1)->first();
        if ($config) {
            $data['koor_tugasakhir'] = True;
        } else {
            $data['koor_tugasakhir'] = False;
        }

        helper(['tanggal']);

        $model = new UserModel();
        $user = $model->where('user_id', $user_id)->first();
---
SELECT *
FROM `tbl_config`
WHERE `config_name` = 'koor_tugasakhir'
AND `config_value` = '13'
 LIMIT 1
SELECT *
FROM `tbl_user`
WHERE `user_id` = '390'
 LIMIT 1

        }

        $model1 = new ProfileModel();
        $profile = $model1->where('user_id', $user_id)->first();
---
SELECT *
FROM `tbl_profile`
WHERE `user_id` = '390'
 LIMIT 1

        $orgmodel = new CapesOrgModel();
        $org = $orgmodel->selectSum('nilai_w1')->selectSum('nilai_w2')->selectSum('nilai_w3')->selectSum('nilai_w4')->selectSum('nilai_pil')->where('user_id', $user_id)->first();
        $pengmodel = new PenghargaanModel();
        $peng = $pengmodel->selectSum('nilai_w1')->selectSum('nilai_w2')->selectSum('nilai_w3')->selectSum('nilai_w4')->selectSum('nilai_pil')->where('user_id', $user_id)->first();
        $sertmodel = new CapesSertModel();
        $sert = $sertmodel->selectSum('nilai_w1')->selectSum('nilai_w2')->selectSum('nilai_w3')->selectSum('nilai_w4')->selectSum('nilai_pil')->where('user_id', $user_id)->first();
        $kualimodel = new CapesKualifikasiModel();
        $kualifikasi = $kualimodel->selectSum('nilai_w1')->selectSum('nilai_w2')->selectSum('nilai_w3')->selectSum('nilai_w4')->selectSum('nilai_pil')->where('user_id', $user_id)->first();
---
SELECT SUM(`nilai_w1`) AS `nilai_w1`, SUM(`nilai_w2`) AS `nilai_w2`, SUM(`nilai_w3`) AS `nilai_w3`, SUM(`nilai_w4`) AS `nilai_w4`, SUM(`nilai_pil`) AS `nilai_pil`
FROM `tbl_penghargaan`
WHERE `user_id` = '390'
 LIMIT 1
SELECT SUM(`nilai_w1`) AS `nilai_w1`, SUM(`nilai_w2`) AS `nilai_w2`, SUM(`nilai_w3`) AS `nilai_w3`, SUM(`nilai_w4`) AS `nilai_w4`, SUM(`nilai_pil`) AS `nilai_pil`
FROM `tbl_kualifikasi`
WHERE `user_id` = '390'
 LIMIT 1

        $semmodel = new CapesSemModel();
        $sem = $semmodel->selectSum('nilai_w1')->selectSum('nilai_w2')->selectSum('nilai_w3')->selectSum('nilai_w4')->selectSum('nilai_pil')->where('user_id', $user_id)->first();
        $inovmodel = new InovasiModel();
        $inov = $inovmodel->selectSum('nilai_w1')->selectSum('nilai_w2')->selectSum('nilai_w3')->selectSum('nilai_w4')->selectSum('nilai_pil')->where('user_id', $user_id)->first();
        $bhsmodel = new BahasaModel();
        $bhs = $bhsmodel->selectSum('nilai_w1')->selectSum('nilai_w2')->selectSum('nilai_w3')->selectSum('nilai_w4')->selectSum('nilai_pil')->where('user_id', $user_id)->first();
---
SELECT SUM(`nilai_w1`) AS `nilai_w1`, SUM(`nilai_w2`) AS `nilai_w2`, SUM(`nilai_w3`) AS `nilai_w3`, SUM(`nilai_w4`) AS `nilai_w4`, SUM(`nilai_pil`) AS `nilai_pil`
FROM `tbl_inovasi`
WHERE `user_id` = '390'
 LIMIT 1
SELECT SUM(`nilai_w1`) AS `nilai_w1`, SUM(`nilai_w2`) AS `nilai_w2`, SUM(`nilai_w3`) AS `nilai_w3`, SUM(`nilai_w4`) AS `nilai_w4`, SUM(`nilai_pil`) AS `nilai_pil`
FROM `tbl_bahasa`
WHERE `user_id` = '390'
 LIMIT 1