app/Controllers/Manakreditasi.php

SELECT *
FROM `tbl_publikasi`
LEFT JOIN `tbl_profile` ON `tbl_publikasi`.`dosen_id`=`tbl_profile`.`user_id`
ORDER BY `dosen_id` DESC
---
    public function dosenpublikasi()
    {
        $session = session();
        $komp_id = $session->get('komp_id');
        $logged_in = $session->get('logged_in');
        $issadmin = $session->get('issadmin');
        if ((!$logged_in) && (!$issadmin)) {
            return redirect()->to('/home');
        }
        helper(['tanggal']);

        $model = new PublikasiModel();
        $data = $model->join('tbl_profile', 'tbl_publikasi.dosen_id=tbl_profile.user_id', 'left')->orderBy('dosen_id', 'DESC')->findall();