app/Controllers/Manbimbing.php

SELECT *
FROM `tbl_bimbing`
LEFT JOIN `tbl_profile` ON `tbl_bimbing`.`mhs_id` = `tbl_profile`.`user_id`
LEFT JOIN `tbl_tugasakhir` ON `tbl_bimbing`.`mhs_id` = `tbl_tugasakhir`.`user_id`
WHERE `tbl_bimbing`.`dosen_id` = '1'
ORDER BY `tbl_tugasakhir`.`ta_tahun` DESC, `tbl_profile`.`FullName` ASC
---
    public function index()
    {
        $session = session();
        $logged_in = $session->get('logged_in');
        $issadmin = $session->get('issadmin');
        $isadmin = $session->get('isadmin');
        $ispenilai = $session->get('ispenilai');
        if ((!$logged_in) && ((!$issadmin) || (!$isadmin) || (!$ispenilai))) {
            return redirect()->to('/home');
        }
        helper(['tanggal']);

        $user_id = $session->get('user_id');
        $model = new BimbingModel();
        $data['logged_in'] = $logged_in;
        $user = $model->where('tbl_bimbing.dosen_id', $user_id)->join('tbl_profile', 'tbl_bimbing.mhs_id = tbl_profile.user_id', 'left')->join('tbl_tugasakhir', 'tbl_bimbing.mhs_id = tbl_tugasakhir.user_id', 'left')->orderby('tbl_tugasakhir.ta_tahun', 'DESC')->orderby('tbl_profile.FullName', 'ASC')->findall();

SELECT *
FROM `tbl_bimbing`
WHERE `mhs_id` = '4'
 LIMIT 1
SELECT *
FROM `tbl_profile`
WHERE `user_id` = '1'
 LIMIT 1
---
    public function lihatformevaluasi($mhs_id, $dosen_id, $ta_id)
    {
        $session = session();
        $logged_in = $session->get('logged_in');
        $issadmin = $session->get('issadmin');
        $isadmin = $session->get('isadmin');
        $ispenilai = $session->get('ispenilai');
        if ((!$logged_in) && ((!$issadmin) || (!$isadmin) || (!$ispenilai))) {
            return redirect()->to('/home');
        }
        helper(['tanggal']);
        helper(['nilai']);

        $model = new BimbingModel();
        $bimbing = $model->where('mhs_id', $mhs_id)->first();
        if ($bimbing) {
            $bimbing_id = $bimbing['dosen_id'];
        }

        $model = new ProfileModel();
        $dosen = $model->where('user_id', $bimbing_id)->first();

SELECT *
FROM `tbl_user`
WHERE `user_id` = '1'
 LIMIT 1
---
        }

        $model = new UserModel();
        $dosennip = $model->where('user_id', $bimbing_id)->first();

SELECT *
FROM `tbl_tugasakhir`
LEFT JOIN `tbl_profile` ON `tbl_tugasakhir`.`user_id` = `tbl_profile`.`user_id`
LEFT JOIN `tbl_user` ON `tbl_tugasakhir`.`user_id` = `tbl_user`.`user_id`
WHERE `ta_id` = '4'
 LIMIT 1
---
        }

        $model = new TugasAkhirModel();
        $tugasakhir = $model->where('ta_id', $ta_id)->join('tbl_profile', 'tbl_tugasakhir.user_id = tbl_profile.user_id', 'left')->join('tbl_user', 'tbl_tugasakhir.user_id = tbl_user.user_id', 'left')->first();

SELECT *
FROM `tbl_nilaita`
WHERE `ta_id` = '4'
AND `mhs_id` = '4'
AND `dosen_id` = '1'
 LIMIT 1
---
        }

        $model = new NilaitaModel();
        $nilaita = $model->where('ta_id', $ta_id)->where('mhs_id', $mhs_id)->where('dosen_id', $dosen_id)->first();