app/Controllers/Manconfig.php

SELECT *
FROM `tbl_config`
WHERE `config_id` = '1'
 LIMIT 1
---
    public function ubahconfig($id)
    {
        $model = new ConfigModel();
        $session = session();
        $logged_in = $session->get('logged_in');
        $issadmin = $session->get('issadmin');
        if ((!$logged_in) && (!$issadmin)) {
            return redirect()->to('/home');
        }
        $config = $model->where('config_id', $id)->first();