app/Controllers/Mannilairpl.php

SELECT *
FROM `tbl_profile`
WHERE `user_id` = '101'
 LIMIT 1
---
    public function penilaianrpl($mhs_id = false, $dosen_id = false)
    {
        $session = session();
        $logged_in = $session->get('logged_in');
        $issadmin = $session->get('issadmin');
        $isadmin = $session->get('isadmin');
        $ispenilai = $session->get('ispenilai');
        if ((!$logged_in) && ((!$issadmin) || (!$isadmin) || (!$ispenilai))) {
            return redirect()->to('/home');
        } else {
            $session->set('role', 'penilai');
        }
        helper(['tanggal', 'nilai']);

        $model = new ProfileModel();
        $mhsprofile = $model->where('user_id', $mhs_id)->first();

SELECT *
FROM `tbl_config`
WHERE `config_name` = 'koor_tugasakhir'
AND `config_value` = '1'
 LIMIT 1
---
        $user_id = $session->get('user_id');

        $modelconfig = new ConfigModel();
        $config = $modelconfig->where('config_name', 'koor_tugasakhir')->where('config_value', $user_id)->first();

SELECT *
FROM `tbl_config`
WHERE `config_name` = 'koor_tugasakhir'
AND `config_value` = '1'
 LIMIT 1
SELECT *
FROM `tbl_profile`
WHERE `user_id` = '101'
 LIMIT 1
---
    public function studikasus($mhs_id, $dosen_id)
    {
        $session = session();
        $logged_in = $session->get('logged_in');
        $issadmin = $session->get('issadmin');
        $isadmin = $session->get('isadmin');
        $ispenilai = $session->get('ispenilai');
        if ((!$logged_in) && ((!$issadmin) || (!$isadmin) || (!$ispenilai))) {
            return redirect()->to('/home');
        } else {
            $session->set('role', 'penilai');
        }
        helper(['tanggal']);

        $user_id = $session->get('user_id');

        $modelconfig = new ConfigModel();
        $config = $modelconfig->where('config_name', 'koor_tugasakhir')->where('config_value', $user_id)->first();
        if ($config) {
            $data['koor_tugasakhir'] = True;
        } else {
            $data['koor_tugasakhir'] = False;
        }

        $modelprof = new ProfileModel();
        $mhsprofile = $modelprof->where('user_id', $mhs_id)->first();