app/Controllers/Manpeserta.php

SELECT *
FROM `tbl_user`
LEFT JOIN `tbl_profile` ON `tbl_user`.`user_id` = `tbl_profile`.`user_id`
LEFT JOIN `tbl_bimbing` ON `tbl_user`.`user_id` = `tbl_bimbing`.`mhs_id`
LEFT JOIN `tbl_pengujirpl` ON `tbl_user`.`user_id` = `tbl_pengujirpl`.`mhsrpl_id`
WHERE `status` IN ('diterima', 'regular')
AND `tipe_user` LIKE '___y'
AND `tbl_user`.`softdelete` = 'no'
ORDER BY `tbl_user`.`user_id` DESC
SELECT *
FROM `tbl_user`
LEFT JOIN `tbl_profile` ON `tbl_user`.`user_id` = `tbl_profile`.`user_id`
WHERE `tipe_user` LIKE '__y_'
AND `tbl_user`.`softdelete` = 'no'
ORDER BY `tbl_user`.`user_id` DESC
---
    public function index()
    {
        $session = session();
        $logged_in = $session->get('logged_in');
        $issadmin = $session->get('issadmin');
        $isadmin = $session->get('isadmin');
        if ((!$logged_in) && ((!$issadmin) || (!$isadmin))) {
            return redirect()->to('/home');
        }
        helper(['tanggal']);

        $user_id = $session->get('user_id');
        $model = new UserModel();
        $data['logged_in'] = $logged_in;
        $where = "tipe_user LIKE '___y'";
        $where1 = "status IN ('diterima', 'regular')";
        $user = $model->join('tbl_profile', 'tbl_user.user_id = tbl_profile.user_id', 'left')->join('tbl_bimbing', 'tbl_user.user_id = tbl_bimbing.mhs_id', 'left')->join('tbl_pengujirpl', 'tbl_user.user_id = tbl_pengujirpl.mhsrpl_id', 'left')->where($where1)->where($where)->where('tbl_user.softdelete', 'no')->orderby('tbl_user.user_id', 'DESC')->findall();
        if (!empty($user)) {
            $data['data_user'] = $user;
        } else {
            $data['data_user'] = 'kosong';
        }

        $where2 = "tipe_user LIKE '__y_'";
        $dosbing = $model->join('tbl_profile', 'tbl_user.user_id = tbl_profile.user_id', 'left')->where($where2)->where('tbl_user.softdelete', 'no')->orderby('tbl_user.user_id', 'DESC')->findall();

SELECT *
FROM `tbl_profile`
WHERE `user_id` = '15'
 LIMIT 1
---
    public function lihatnilairpl($id)
    {
        $session = session();
        $logged_in = $session->get('logged_in');
        $issadmin = $session->get('issadmin');
        $isadmin = $session->get('isadmin');
        if ((!$logged_in) && ((!$issadmin) || (!$isadmin))) {
            return redirect()->to('/home');
        }
        helper(['tanggal']);
        helper(['nilai']);

        $model = new ProfileModel();
        $mhsprofile = $model->where('user_id', $id)->first();