app/Controllers/Mantugasakhir.php

SELECT *
FROM `tbl_tugasakhir`
LEFT JOIN `tbl_profile` ON `tbl_tugasakhir`.`user_id` = `tbl_profile`.`user_id`
LEFT JOIN `tbl_user` ON `tbl_tugasakhir`.`user_id` = `tbl_user`.`user_id`
ORDER BY `tbl_tugasakhir`.`ta_tahun` DESC, `tbl_tugasakhir`.`ta_semester` ASC, `tbl_profile`.`FullName` ASC
---
    public function index()
    {
        $session = session();
        $logged_in = $session->get('logged_in');
        $issadmin = $session->get('issadmin');
        $isadmin = $session->get('isadmin');
        if ((!$logged_in) && ((!$issadmin) || (!$isadmin))) {
            return redirect()->to('/home');
        }
        helper(['tanggal']);

        $user_id = $session->get('user_id');
        $model = new TugasAkhirModel();
        $data['logged_in'] = $logged_in;
        $tugasakhir = $model->join('tbl_profile', 'tbl_tugasakhir.user_id = tbl_profile.user_id', 'left')->join('tbl_user', 'tbl_tugasakhir.user_id = tbl_user.user_id', 'left')->orderby('tbl_tugasakhir.ta_tahun', 'DESC')->orderby('tbl_tugasakhir.ta_semester', 'ASC')->orderby('tbl_profile.FullName', 'ASC')->findall();

SELECT *
FROM `tbl_penguji`
LEFT JOIN `tbl_profile` ON `tbl_penguji`.`penguji` = `tbl_profile`.`user_id`
WHERE `ta_id` = '3'
AND `tbl_penguji`.`user_id` = '12'
ORDER BY `uji_id` DESC
---
    public function setpenguji($ta_id, $user_id)
    {
        $session = session();
        $logged_in = $session->get('logged_in');
        $issadmin = $session->get('issadmin');
        $isadmin = $session->get('isadmin');
        if ((!$logged_in) && ((!$issadmin) || (!$isadmin))) {
            return redirect()->to('/home');
        }
        $model = new TugasAkhirModel();
        $penguji = $model->where('ta_id', $ta_id)->join('tbl_profile', 'tbl_tugasakhir.ta_penguji = tbl_profile.user_id', 'left')->orderby('ta_id', 'DESC')->findall();

SELECT *
FROM `tbl_bimbing`
WHERE `mhs_id` = '4'
 LIMIT 1
SELECT *
FROM `tbl_profile`
WHERE `user_id` = '1'
 LIMIT 1
SELECT *
FROM `tbl_tugasakhir`
LEFT JOIN `tbl_profile` ON `tbl_tugasakhir`.`user_id` = `tbl_profile`.`user_id`
LEFT JOIN `tbl_user` ON `tbl_tugasakhir`.`user_id` = `tbl_user`.`user_id`
WHERE `ta_id` = '3'
 LIMIT 1
---
    public function daftarhadir($mhs_id, $ta_id)
    {
        $session = session();
        $logged_in = $session->get('logged_in');
        $issadmin = $session->get('issadmin');
        $isadmin = $session->get('isadmin');
        $ispenilai = $session->get('ispenilai');
        if ((!$logged_in) && ((!$issadmin) || (!$isadmin) || (!$ispenilai))) {
            return redirect()->to('/home');
        }
        helper(['tanggal']);
        helper(['nilai']);

        $model = new BimbingModel();
        $bimbing = $model->where('mhs_id', $mhs_id)->first();
        if ($bimbing) {
            $bimbing_id = $bimbing['dosen_id'];
        }

        $model = new ProfileModel();
        $dosen = $model->where('user_id', $bimbing_id)->first();
        if ($dosen) {
            $data['namapembimbing'] = $dosen['FullName'];
        }

        $model = new TugasAkhirModel();
        $tugasakhir = $model->where('ta_id', $ta_id)->join('tbl_profile', 'tbl_tugasakhir.user_id = tbl_profile.user_id', 'left')->join('tbl_user', 'tbl_tugasakhir.user_id = tbl_user.user_id', 'left')->first();

SELECT *
FROM `tbl_nilaita`
LEFT JOIN `tbl_profile` ON `tbl_nilaita`.`dosen_id` = `tbl_profile`.`user_id`
WHERE `ta_id` = '3'
---
        }

        $model = new NilaitaModel();
        $nilaita = $model->where('ta_id', $ta_id)->join('tbl_profile', 'tbl_nilaita.dosen_id = tbl_profile.user_id', 'left')->findall();