app/Controllers/Manuser.php

SELECT *
FROM `tbl_user`
WHERE `softdelete` = 'no'
ORDER BY `user_id` DESC
---
    public function index()
    {
        $session = session();
        $logged_in = $session->get('logged_in');
        $issadmin = $session->get('issadmin');
        if ((!$logged_in) && (!$issadmin)) {
            return redirect()->to('/home');
        }
        helper(['tanggal']);

        $user_id = $session->get('user_id');
        $model = new UserModel();
        $data['logged_in'] = $logged_in;
        $user = $model->where('softdelete', 'no')->orderBy('user_id', 'DESC')->findall();

SELECT *
FROM `tbl_user`
WHERE `user_id` = '99'
 LIMIT 1
---
    public function ubahanggota($id)
    {
        $model = new UserModel();
        $session = session();
        $logged_in = $session->get('logged_in');
        $issadmin = $session->get('issadmin');
        if ((!$logged_in) && (!$issadmin)) {
            return redirect()->to('/home');
        }
        $anggota = $model->where('user_id', $id)->first();

UPDATE `tbl_user` SET `active` = 'yes', `nodaftar` = '722011215', `NPM` = '2206123562', `NIP` = '196101241986022001', `id_faip` = '26898', `status` = 'staff', `thnajaran` = '2022', `semester` = 'Ganjil', `tipe_user` = 'nnyy', `confirmcapes` = 'Ya', `confirmfair` = 'Ya', `signed` = '12_ttd.jpg>', `tipe_peserta` = 'RPL', `date_modified` = '2023-08-22 16:46:41'
WHERE `tbl_user`.`user_id` IN ('12')
---
                        'date_modified' => date('Y-m-d H:i:s')
                    );
                }
                $model->update($user_id, $datauser);