app/Controllers/Myprofile.php

    public function ubah($id)
    {
        $session = session();
        $logged_in = $session->get('logged_in');
        if (!$logged_in) {
            return redirect()->to('/home');
        }
        helper(['tanggal']);

        $model = new ProfileModel();
        $user = $model->where('tbl_profile.user_id', $id)->join('tbl_user', 'tbl_profile.user_id = tbl_user.user_id', 'left')->first();
---
SELECT *
FROM `tbl_profile`
LEFT JOIN `tbl_user` ON `tbl_profile`.`user_id` = `tbl_user`.`user_id`
WHERE `tbl_profile`.`user_id` = '115'
 LIMIT 1


        //Koordinator TA Reguler
        $model2 = new ConfigModel();
        $config = $model2->where('config_name', 'koor_tugasakhir')->where('config_value', $id)->first();
---
SELECT *
FROM `tbl_config`
WHERE `config_name` = 'koor_tugasakhir'
AND `config_value` = '115'
 LIMIT 1