app/Controllers/Nilairpl.php

SELECT *
FROM `tbl_profile`
WHERE `user_id` = '399'
 LIMIT 1
---
    public function seminar($mhs_id, $dosen_id)
    {
        $session = session();
        $logged_in = $session->get('logged_in');
        $issadmin = $session->get('issadmin');
        $isadmin = $session->get('isadmin');
        $ispenilai = $session->get('ispenilai');
        if ((!$logged_in) && ((!$issadmin) || (!$isadmin) || (!$ispenilai))) {
            return redirect()->to('/home');
        } else {
            $session->set('role', 'penilai');
        }
        helper(['tanggal']);

        $modelprof = new ProfileModel();
        $mhsprofile = $modelprof->where('user_id', $mhs_id)->first();