app/Controllers/Nilairpl.php

    public function docs($mhs_id = false, $dosen_id = false)
    {
        $session = session();
        $logged_in = $session->get('logged_in');
        $issadmin = $session->get('issadmin');
        $isadmin = $session->get('isadmin');
        $ispenilai = $session->get('ispenilai');
        if ((!$logged_in) && ((!$issadmin) || (!$isadmin) || (!$ispenilai))) {
            return redirect()->to('/home');
        } else {
            $session->set('role', 'penilai');
        }
        helper(['tanggal']);

        $model = new ProfileModel();
        $mhsprofile = $model->where('user_id', $mhs_id)->first();
---
SELECT *
FROM `tbl_profile`
WHERE `user_id` = '17'
 LIMIT 1

    public function profesi($mhs_id, $dosen_id)
    {
        $session = session();
        $logged_in = $session->get('logged_in');
        $issadmin = $session->get('issadmin');
        $isadmin = $session->get('isadmin');
        $ispenilai = $session->get('ispenilai');
        if ((!$logged_in) && ((!$issadmin) || (!$isadmin) || (!$ispenilai))) {
            return redirect()->to('/home');
        } else {
            $session->set('role', 'penilai');
        }
        helper(['tanggal']);

        //UserFair3
        $model = new CapesKualifikasiModel();
        $data['capeslogged_in'] = $session->get('capeslogged_in');
        $kerja = $model->where('user_id', $mhs_id)->like('kompetensi', 'W.2.2.')->orderby('ProjValue', 'DESC')->findall();
---
SELECT *
FROM `tbl_kualifikasi`
WHERE `user_id` = '17'
AND `kompetensi` LIKE "W.1.1%" OR `kompetensi` LIKE "W.2.2.%"
ORDER BY `ProjValue` DESC


        //UserFair14
        $model3 = new PenghargaanModel();
        $penghargaan = $model3->where('user_id', $mhs_id)->like('kompetensi', 'W.1.1.')->orderby('Year', 'DESC')->orderby('Month', 'DESC')->findall();
        $data['jumlah_harga'] = $model3->where('user_id', $mhs_id)->like('kompetensi', 'W.1.1.')->countAllResults();
---
SELECT *
FROM `tbl_penghargaan`
WHERE `user_id` = '17'
AND  `kompetensi` LIKE '%W.1.1.%' ESCAPE '!'
ORDER BY `Year` DESC, `Month` DESC
SELECT COUNT(*) AS `numrows`
FROM `tbl_penghargaan`
WHERE `user_id` = '17'
AND  `kompetensi` LIKE '%W.1.1.%' ESCAPE '!'

        }

        //UserFair16
        $latih1 = $model4->where('user_id', $mhs_id)->where('Jenis', 'sertifikat')->like('kompetensi', 'W.1.1.')->findall();
---
SELECT *
FROM `tbl_sertifikat`
WHERE `user_id` = '17'
AND `Jenis` = 'sertifikat'
AND  `kompetensi` LIKE '%W.1.1.%' ESCAPE '!'