app/Controllers/Peserta.php

    public function index()
    {
        $session = session();
        $logged_in = $session->get('logged_in');
        $ispeserta = $session->get('ispeserta');
        if ((!$logged_in) && (!$ispeserta)) {
            return redirect()->to('/home');
        } else {
            $session->set('role', 'peserta');
        }

        $model = new UmumModel();
        $umum = $model->like('umum_tujuan', '_y_')->orderby('umum_id', 'DESC')->findall();
---
SELECT *
FROM `tbl_umum`
WHERE `umum_tujuan` LIKE '%_y_%' ESCAPE '!'
ORDER BY `umum_id` DESC