app/Controllers/Register.php

    public function dashboard()
    {
        $session = session();

        $capeslogged = $session->get('capeslogged_in');
        if (empty($capeslogged)) {
            return redirect()->to('/register');
        }

        $user_id = $session->get('user_id');
        $profile = new CapesProfileModel();
        $dataprofile = $profile->where('user_id', $user_id)->first();
        $pengkerja = new CapesKualifikasiModel();
        $datapengkerja = $pengkerja->where('user_id', $user_id)->first();
        $organ = new CapesOrgModel();
        $dataorgan = $organ->where('user_id', $user_id)->first();
        $pelsert = new CapesSertModel();
        $datalatih = $pelsert->where('user_id', $user_id)->where('Jenis', 'pelatihan')->first();
        $datasert = $pelsert->where('user_id', $user_id)->where('Jenis', 'sertifikat')->first();
---
SELECT *
FROM `tbl_profile`
WHERE `user_id` = '4'
 LIMIT 1
SELECT *
FROM `tbl_kualifikasi`
WHERE `user_id` = '4'
 LIMIT 1
SELECT *
FROM `tbl_sertifikat`
WHERE `user_id` = '4'
AND `Jenis` = 'sertifikat'
 LIMIT 1

    public function profile()
    {
        $session = session();
        $capeslogged_in = $session->get('capeslogged_in');
        if (!$capeslogged_in) {
            return redirect()->to('/register');
        }
        helper(['tanggal']);

        $user_id = $session->get('user_id');
        $model = new CapesProfileModel();
        $user = $model->where('user_id', $user_id)->first();
---
SELECT *
FROM `tbl_profile`
WHERE `user_id` = '4'
 LIMIT 1