app/Controllers/Seminarreg.php

SELECT *
FROM `tbl_semreg`
WHERE `tbl_semreg`.`mhs_id` = '115'
ORDER BY `tbl_semreg`.`sem_id` DESC
---
    public function index()
    {
        $session = session();
        $logged_in = $session->get('logged_in');
        $ispeserta = $session->get('ispeserta');
        $tipepeserta = $session->get('tipepeserta');
        if ((!$logged_in) && (!$ispeserta) && ($tipepeserta != 'Reguler')) {
            return redirect()->to('/home');
        }
        helper(['tanggal']);

        $user_id = $session->get('user_id');
        $model = new SeminarModel();
        $data['logged_in'] = $logged_in;
        $sem = $model->where('tbl_semreg.mhs_id', $user_id)->orderBy('tbl_semreg.sem_id', 'DESC')->findall();