app/Controllers/Superadmin.php

SELECT *
FROM `tbl_umum`
ORDER BY `umum_id` DESC
---
    public function index()
    {
        $session = session();
        $logged_in = $session->get('logged_in');
        $issadmin = $session->get('issadmin');
        if ((!$logged_in) && (!$issadmin)) {
            return redirect()->to('/home');
        } else {
            $session->set('role', 'superadmin');
        }

        $model = new UmumModel();
        $umum = $model->orderby('umum_id', 'DESC')->findall();