app/Controllers/Tugasakhir.php

SELECT *
FROM `tbl_tugasakhir`
LEFT JOIN `tbl_profile` ON `tbl_profile`.`user_id` = `tbl_tugasakhir`.`ta_bimbing`
WHERE `tbl_tugasakhir`.`user_id` = '12'
ORDER BY `tbl_tugasakhir`.`ta_id` DESC
---
    public function index()
    {
        $session = session();
        $logged_in = $session->get('logged_in');
        $ispeserta = $session->get('ispeserta');
        if ((!$logged_in)&&(!$ispeserta)){
            return redirect()->to('/home');
        }
        helper(['tanggal']);

        $user_id = $session->get('user_id');
        $model = new TugasAkhirModel();
        $data['logged_in'] = $logged_in;
        $ta = $model->where('tbl_tugasakhir.user_id', $user_id)->join('tbl_profile', 'tbl_tugasakhir.ta_penguji = tbl_profile.user_id', 'left')->orderBy('tbl_tugasakhir.ta_id', 'DESC')->findall();