app/Controllers/Userfairlamp.php

    public function docs($id = false)
    {
        $session = session();
        $logged_in = $session->get('logged_in');
        $ispeserta = $session->get('ispeserta');
        $ispenilai = $session->get('ispenilai');
        if ((!$logged_in)&&(!$ispeserta)||(!$ispenilai)){
            return redirect()->to('/home');
        }

        if (!empty($id)){
            $user_id = $id;
        }else{
            $user_id = $session->get('user_id');
        }
        helper(['tanggal']);

        $model = new UserModel();
        $user = $model->where('user_id', $user_id)->first();
---
SELECT *
FROM `tbl_user`
WHERE `user_id` = '4'
 LIMIT 1