app/Views/maintemp/peserta.php

                                        <td><?php
                                            if (!empty($user['dosen_id'])) {
                                                $model = new ProfileModel();
                                                $dosen = $model->where('user_id', $user['dosen_id'])->first();
---
SELECT *
FROM `tbl_profile`
WHERE `user_id` = '72'
 LIMIT 1

                                        <td><?php
                                            if (!empty($user['dosenrpl_id'])) {
                                                $model = new ProfileModel();
                                                $dosen = $model->where('user_id', $user['dosenrpl_id'])->first();
---
SELECT *
FROM `tbl_profile`
WHERE `user_id` = '1'
 LIMIT 1